## We'd need a some kinda intermediary to connect our python notebook to MySQL. And that intermediary is what is known as 'connector'.
### Thus we ought to install this Connector below.

In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\suryansh grover\anaconda3\lib\site-packages (8.0.29)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\suryansh grover\anaconda3\lib\site-packages (from mysql-connector-python) (3.20.1)

In [1]:
from mysql.connector import *

In [2]:
try:
    mydb = connect(host="localhost", user="root", passwd = "#Starrdomm9958", use_pure = "True")
    print(mydb)
    
    cur = mydb.cursor() #creating a cursor for seeking specific indexes.
    
    cur.execute("show databases") #executing a SQl query.
    
except Exception as e:
    print(e)

<mysql.connector.connection.MySQLConnection object at 0x00000216D953DF40>

In [4]:
res = cur.fetchall()

In [5]:
cur.execute("create database if not exists myfirstdb")
res

[('information_schema',),
 ('mydb2',),
 ('mydb3',),
 ('myfirstdb',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [32]:
res

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [24]:
cur.execute("drop database myfirstdb") #deleting an already existing database.
cur.reset(0)

In [51]:
mydb.close()

In [6]:
mydb = connect(host="localhost", user="root", database = 'myfirstdb', passwd = "#Starrdomm9958", use_pure = "True")
mydb.is_connected()

True

In [7]:
cur1 = mydb.cursor()

In [8]:
cur1.execute("create table if not exists test(x1 INT(5), x2 VARCHAR(20), x3 DATE) ")

In [5]:
cur1.execute("insert into test values(1999, 'Woah!', '1999-11-26')")
mydb.commit() #This is a required step after making some changes into a table after creating one.

In [63]:
cur1.reset(0)

In [9]:
cur1.execute("select * from test")

In [10]:
cur1.fetchall()

[(1999, 'Woah!', datetime.date(1999, 11, 26)),
 (1999, 'Woah!', datetime.date(1999, 11, 26)),
 (1999, 'Woah!', datetime.date(1999, 11, 26)),
 (1999, 'Woah!', datetime.date(1999, 11, 26)),
 (1999, 'Woah!', datetime.date(1999, 11, 26)),
 (1999, 'Woah!', datetime.date(1999, 11, 26))]

In [16]:
cur2 = mydb.cursor()
cur2.execute("select x1, x2 from test")

In [17]:
cur2.fetchall()

[(1999, 'Woah!'),
 (1999, 'Woah!'),
 (1999, 'Woah!'),
 (1999, 'Woah!'),
 (1999, 'Woah!'),
 (1999, 'Woah!')]

## Importing Pandas:

In [17]:
from pandas import *
import csv
'''
Nothing just a library that deals with the structured form of data.
'''

'\nNothing just a library that deals with the structured form of data.\n'

In [20]:
read_sql("select * from myfirstdb.test", mydb)

     x1     x2          x3
0  1999  Woah!  1999-11-26
1  1999  Woah!  1999-11-26
2  1999  Woah!  1999-11-26
3  1999  Woah!  1999-11-26
4  1999  Woah!  1999-11-26
5  1999  Woah!  1999-11-26

In [23]:
a = read_sql("select * from myfirstdb.test", mydb)
a.to_csv("myfirstcsv.csv") #creating a .csv and sending this tabular data into it.

### Now, we'll try to dump this tabular data to the MySQL directly into a newly created table having schema as n1, n2 and n3.

In [11]:
mydb1 = connect(host="localhost", user="root", database = 'myfirstdb', passwd = "#Starrdomm9958", use_pure = "True")
mydb1

In [12]:
cur1 = mydb1.cursor()

In [13]:
try:
    cur1.execute('create table if not exists mydata2(n1 int(5), n2 varchar(20), n3 date)')
except Exception as e:
    print(e)

In [14]:
try:
    cur1.execute("insert into mydata2 values(0, 1000, 'Nah!', '2000-10-28')")
except Exception as e:
    print(e)

In [15]:
cur1.execute("insert into mydata2 values(0, 1972, 'woah!', '2000-10-31')")
mydb1.commit()

In [18]:
mydb1.commit()
read_sql("select * from mydata2", mydb1)

   n0    n1     n2          n3
0   0  1000   Nah!  2000-10-28
1   0  1000   Nah!  2000-10-28
2   0  1000  woah!  2000-10-28
3   0  1000  woah!  2000-10-28
4   0  1965  woah!  2000-10-31
5   0  1972  woah!  2000-10-31
6   0  1000   Nah!  2000-10-28
7   0  1972  woah!  2000-10-31

In [15]:
data = read_csv("myfirstcsv.csv")
print(data)

   Unnamed: 0    x1       x2          x3
0           0  1999  'Woah!'  1999-11-26
1           1  1999  'Woah!'  1999-11-26
2           2  1999  'Woah!'  1999-11-26
3           3  1999  'Woah!'  1999-11-26
4           4  1999  'Woah!'  1999-11-26
5           5  1999  'Woah!'  1999-11-26

In [13]:
try:
    data.to_sql("mydata", con = mydb)
except Exception as e:
    print(e)

Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': Not all parameters were used in the SQL statement

C:\Users\Suryansh Grover\anaconda3\lib\site-packages\pandas\core\generic.py:2872: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

In [11]:
pwd()

'C:\\Users\\Suryansh Grover\\iNeuron\\3. Databases'

In [18]:
try:
    with open("myfirstcsv.csv", "r") as data:
        next(data)
    
        data = csv.reader(data, delimiter = '\n')
        for i in enumerate(data):
            print(i)
            for j in i[1]:
                print(j)
                cur1.execute("insert into mydata2 values({rowdata})".format(rowdata = j))
        print("All data dumped!")
    mydb1.commit() 
    
except Exception as e:
    print(e)

(0, ['0,1999,Woah!,1999-11-26'])
0,1999,Woah!,1999-11-26
1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '!,1999-11-26)' at line 1

In [ ]:
https://archive.ics.uci.edu/ml/machine-learning-databases/00448/